
import React from 'react';
import { Row, Col,Card, Button} from 'antd';



class DataProtocol extends React.Component {


  render() {
    return (
        <Row>
          <Col span="18" offset={3}>
            <div style={{padding: '50px 0 20px', textAlign: 'center', fontSize: 18, fontWeight: 900}}>时光数据服务使用协议</div>
            <div className="f14" style={{textAlign: 'justify'}}>
              用户应当充分阅读本协议，用户使用时光任何数据服务亦视为接受本协议。
              <p className="f-title">一、定义</p>
              用户： 以任何形式使用时光的自然人、法人或其他组织。<br/>
              <p className="f-title">二、用户保证</p>
              1.用户同意并保证，在本协议有效期内，时光有权于任何时间要求用户提交相关资质证明资料原件及/或其他资料信息，用户对其所提交信息的真实完整、合法有效性承担保证责任。<br/>
              2. 用户同意并保证，合法并如约使用时光数据服务。用户对其行为产生的任何法律责任自行独立承担，与时光无关。<br/>
              <p className="f-title">三、用户的权利与义务</p>
              1. 用户有权就时光申请账号，用户注册账号，应向时光提供真实完整且合法有效的信息。 如用户信息发生任何变更，用户应于变更后书面通知时光并提供最新资料信息。<br/>
              2. 用户需要自行保管其帐号和密码。用户帐号、密码使用权仅属于初始申请注册人，禁止赠与、借用、租用、转让或者售卖，如果用户进行此类操作导致密码泄露造成损失的，时光并不承担责任。<br/>
              3. 用户应按使用时光的实际发送数量，根据时光页面公布资费标准向时光支付相应的费用。<br/>
              4. 用户保证其所提供的手机号码列表的真实性、合法性、有效性及许可性，用户有义务对手机列表进行筛选。否则时光有权随时终止本协议。<br/>
              5. 用户在使用时光数据服务期间，承诺并保证：<br/>
              （1） 遵守所有中华人民共和国法律法规和国际上有关互联网和短信的协议、规定、程序和惯例；<br/>
              （2） 不利用时光短信API服务进行干扰或扰乱时光网络服务或其他正常使用；<br/>
              （3） 不行使其他可能给时光带来任何不利影响的行为或者法律及政策禁止的行为。<br/>
              6. 用户不得利用时光数据服务发送以下内容的信息：<br/>
              （1）接受方事先没有提出要求或者同意接受的广告等宣传性或营销性内容；<br/>
              （2）含有病毒、恶意代码、色情、反动等不良信息或有害信息<br/>
              （3）地产、医疗、教育、留学、移民等相关内容<br/>
              （4）冒充任何人或机构，或以虚伪不实的方式谎称或使人误认为与任何人或任何机构有关。<br/>
              （5）侵犯他人著作权或其他知识产权，或违反保密、雇佣或不披露协议披露他人商业秘密或保密信息。<br/>
              7. 用户应对相关数据自行存储和备份并至少保留六十日。根据时光或国家主管部门的要求，用户应向其提供备份内容。用户使用时光数据服务，不得于任何时间任何事件中使用时光的Logo、服务标记、域名及其他具有时光显著特征的标识。<br/>
              8. 用户应当按照本协议以及时光不时公布的规定，妥善使用时光数据服务并为其行为负责。因用户行为导致时光遭受诉讼、索赔及/或处罚的，用户应赔偿时光因此造成的全部损失。<br/>
              9. 本协议一经生效时光即有权永久免费使用用户的商业名称、商标、Logo等信息作为案例宣传时光旗下的相关服务。<br/>
              10. 用户同意接收来自时光的邮件及短信，包括但不限于商业推广信息等。<br/>
              <p className="f-title">四、时光的权利与义务</p>
              1. 时光对用户行为无审核监督义务。因用户行为给时光造成的一切损失，时光有权向用户追偿。<br/>
              2. 时光有权随时调整时光数据服务的资费，但该调整不会对用户已购买的服务产生影响。<br/>
              3. 时光有权对时光数据服务进行定期或不定期的升级或完善，但应提前在相关页面进行公告。如用户因此受到影响，时光无需为此承担任何责任。<br/>
              4. 时光有权根据自己的判断对用户是否违反本协议约定及时光数据服务使用规则做出认定。用户若有违反的，时光有权随时中止或终止本协议。时光无需就此征得用户同意或提前通知用户。<br/>
              5. 因非时光原因导致的本协议提前终止，用户已经支付而尚未使用的费用时光有权不予退还。<br/>
              6. 鉴于互联网服务的特殊性，对因不可抗力、第三方服务、黑客攻击、政策影响及其他任何非时光原因引起的服务中断、数据丢失等，时光均无需承担任何责任。<br/>
              <p className="f-title">五、知识产权</p>
              1. 时光服务中包含的任何文字、图表、音频、视频和/或软件（包括但不限于软件中包含的图表、动画、音频、视频、界面实际、数据和程序、代码、文档）等信息或材料均受著作权法、商标法或其它法律法规的保护，未经相关权利人书面同意，用户不得以任何方式使用该等信息或材料，但出于使用时光服务目的而使用的除外。<br/>
              2. 除本协议明确允许的以外，用户不得以任何形式或任何方式对时光服务部分或全部内容进行修改、出租、租赁、出借、出售、分发、复制、创作衍生品或用于任何商业用途。<br/>
              3. 用户使用时光发布的信息不得侵犯任何第三人的知识产权，未经相关权利人之事先书面同意，用户不得以任何方式上传、发布、修改、传播或复制任何受著作权保护的材料、商标或属于其他人的专有信息。<br/>
              4. 若您认为您的知识产权或其他合法权益被侵犯，请向时光提供以下资料：
              （1） 对涉嫌侵权内容拥有知识产权或其他合法权益的权属证明；<br/>
              （2） 权利人具体的主体资质和联络信息，包括个人的姓名、身份证或护照复印件、单位的营业执照复印件或者其他资质证明复印件、通信地址及电话号码等；<br/>
              （3） 涉嫌侵权内容在本网站上的位置；<br/>
              （4） 对侵权情况的详细描述；<br/>
              （5） 在权利通知中加入如下关于通知内容真实性的声明：“由以上操作所引起的一切后果，与时光无关，由我本人/公司承担。”在签字或加盖公章后发往以下邮箱： service@cx580.com<br/>
              <p className="f-title">六、 隐私权</p>
              1. 保护用户的隐私是时光的一项基本政策。<br/>
              2. 适用于用户的隐私的相关条款请参见 《隐私协议》<br/>
              <p className="f-title">七、 免责声明</p>
              1. 鉴于网络服务的特殊性，时光不保证网络服务的绝对及时性、安全性和准确性，用户同意时光有权不经事先通知，随时变更、中断或终止部分或全部的网络服务而无论同意与否，时光对用户和任何第三人均无需承担任何责任。<br/>
              2. 用户经由时光服务与广告商进行通讯联系或商业往来或参与促销活动，完全属于用户与广告商之间的行为，与时光没有任何关系，若因商业行为所产生之任何损害或损失，时光不承担任何责任。<br/>
              3. 用户明确同意其使用时光服务所存在的风险及其后果将完全由其自己承担，时光对用户不承担任何责任。如因用户违反有关法律、法规或本协议项下的任何条款而给时光或任何其他第三人造成损失，用户同意承担由此造成的损害赔偿责任。<br/>
              <p className="f-title">八、其他</p>
              1. 本协议的版权归时光，时光保留对本协议的一切解释和修改权利。<br/>
              2. 本协议的订立、执行和争议的解决均应适用中华人民共和国法律。如双方就本协议内容或其执行发生任何争议，双方应尽量友好协商解决；协商不成时，任何一方均可向时光所在地有管辖权的人民法院提起诉讼。<br/>
              3. 时光行使本协议的任何权利或规定，不构成对前述权利之放弃。<br/>
              4. 如本协议中的任何条款完全或部分无效，本协议的其余条款仍有效并且有约束力。<br/>
            </div>
            <div className="center">
              <Button onClick={()=>{window.close()}} type="primary"  size="large" style={{width: '150',marginTop: 20, marginBottom: 50}}>我知道了</Button>
            </div>
          </Col>
        </Row>
    );
  }
}


export default DataProtocol